Autodesk.Revit.UI.Selection.Selection.SetReferences(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Selects the references. The references can be an element or a subelement in the host or a linked document.
Remarks:
This function will select the specified references and update the UI.
references:
The references to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Changing the selection is not permitted while handling SelectionChanged Event.
Since:
2023

Autodesk.Revit.UI.Selection.Selection.GetReferences
Returns the references that are currently selected.
Remarks:
The references can be an element or subelement in the host or a linked document.
Returns:
The collection containing the selected references.
Since:
2023

Autodesk.Revit.UI.Selection.Selection.GetElementIds
Returns the ids of the elements that are currently selected within the project.
The selection may not be complete. See GetReferences for more options.
Returns:
The collection containing the ids of the selected elements.

Autodesk.Revit.UI.Selection.Selection.SetElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Selects the elements.
Remarks:
This function will select the specified elements within the project and update the UI.
See SetReferences for more selection options.
elementIds:
The ids of the elements to be selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Changing the selection is not permitted while handling SelectionChanged Event.
Since:
2015

Autodesk.Revit.UI.Selection.Selection.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.Selection.Selection.PickElementsByRectangle(Autodesk.Revit.UI.Selection.ISelectionFilter,System.String)
Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter while showing a custom status prompt string.
selectionFilter: The selection filter.
statusPrompt: The message shown on the status bar.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null or statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of elements selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickElementsByRectangle(Autodesk.Revit.UI.Selection.ISelectionFilter)
Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter.
selectionFilter: The selection filter.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of elements selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickElementsByRectangle(System.String)
Prompts the user to select multiple elements by drawing a rectangle while showing a custom status prompt string.
statusPrompt: The message shown on the status bar.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of elements selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickElementsByRectangle
Prompts the user to select multiple elements by drawing a rectangle.
Prompts the user to select multiple elements by drawing a rectangle.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of elements selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickBox(Autodesk.Revit.UI.Selection.PickBoxStyle,System.String)
Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
style: Specifies the value that controls the style of the pick box.
statusPrompt: The message shown on the status bar.
Remarks:
The method starts an editor and returns when it finishes. Returns a PickedBox that contains two XYZ points.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the style is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the argument statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Returns: The picked box that contains two XYZ points.

Autodesk.Revit.UI.Selection.Selection.PickBox(Autodesk.Revit.UI.Selection.PickBoxStyle)
Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.
style: Specifies the value that controls the style of the pick box.
Remarks:
The method starts an editor and returns when it finishes. Returns a PickedBox that contains two XYZ points.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the style is not a recognized value.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Returns: The picked box that contains two XYZ points.

Autodesk.Revit.UI.Selection.Selection.PickPoint(Autodesk.Revit.UI.Selection.ObjectSnapTypes,System.String)
Prompts the user to pick a point on the active work plane using specified snap settings while showing a custom status prompt string.
snapSettings: Specifies the object snap types for this pick. Multiple object snap types can be combined with "|"
statusPrompt: Specifies the message shown on the status bar.
Remarks: Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the argument statusPrompt is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when no work plane set in current view.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
The point picked by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickPoint(System.String)
Prompts the user to pick a point on the active work plane while showing a custom status prompt string.
statusPrompt: Specifies the message shown on the status bar.
Remarks: Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the argument statusPrompt is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when no work plane set in current view.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
The point picked by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickPoint(Autodesk.Revit.UI.Selection.ObjectSnapTypes)
Prompts the user to pick a point on the active work plane using specified snap settings.
snapSettings: Specifies the object snap types for this pick. Multiple object snap types can be combined with "|"
Remarks: Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when no work plane set in current view.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
The point picked by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickPoint
Prompts the user to pick a point on the active work plane.
Prompts the user to pick a point on the active work plane.
Remarks: Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when no work plane set in current view.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
The point picked by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string. A preselected set of objects may be supplied and will be selected at the start of the selection.
objectType: Specifies the type of object to be selected.
selectionFilter: The selection filter.
statusPrompt: The message shown on the status bar.
pPreSelected: The previously selected set of objects.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
The previously selected set of objects will be highlighted.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the Revit user cancelled this operation.
Thrown when pPreSelected references has objects that are not the type of objectType.
Thrown when objectType is PointOnElement which is not supported for selection involving preselected items.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter,System.String)
Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string.
objectType: Specifies the type of object to be selected.
selectionFilter: The selection filter.
statusPrompt: The message shown on the status bar.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null or statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter)
Prompts the user to select multiple objects which pass a customer filter.
objectType: Specifies the type of object to be selected.
selectionFilter: The selection filter.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType,System.String)
Prompts the user to select multiple objects while showing a custom status prompt string.
objectType: Specifies the type of object to be selected.
statusPrompt: The message shown on the status bar.
Remarks: >The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.The selection will not be automatically added to the active selection buffer.Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObjects(Autodesk.Revit.UI.Selection.ObjectType)
Prompts the user to select multiple objects.
Prompts the user to select multiple objects.
objectType: Specifies the type of object to be selected.
Remarks:
The user will be shown "Finish" and "Cancel" buttons on the dialog bar to complete the selection operation.
Uncheck the "Multiple" check-box to select single object and it will return the selected object directly.
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A collection of references selected by the user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter,System.String)
Prompts the user to select one object which passes a custom filter while showing a custom status prompt string.
objectType: Specifies the type of object to be selected.
selectionFilter: The selection filter.
statusPrompt: The message shown on the status bar.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null or statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A reference object selected by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType,Autodesk.Revit.UI.Selection.ISelectionFilter)
Prompts the user to select one object which passes a custom filter.
objectType: Specifies the type of object to be selected.
selectionFilter: The selection filter.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the selectionFilter is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A reference object selected by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType,System.String)
Prompts the user to select one object while showing a custom status prompt string.
objectType: Specifies the type of object to be selected.
statusPrompt: The message shown on the status bar.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when the statusPrompt is null.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancelled this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A reference object selected by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection.PickObject(Autodesk.Revit.UI.Selection.ObjectType)
Prompts the user to select one object.
Prompts the user to select one object.
objectType: Specifies the type of object to be selected.
Remarks:
Revit users will be permitted to manipulate the Revit view (zooming, panning, and rotating the view),
but will not be permitted to click other items in the Revit user interface.
Users are not permitted to switch the active view, close the active document or Revit application in the pick session, otherwise an exception will be thrown.
The selection will not be automatically added to the active selection buffer.
Note: this method must not be called during dynamic update, otherwise ForbiddenForDynamicUpdateException will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the objectType is not a recognized value.
Throws Autodesk.Revit.Exceptions.OperationCanceledException: Thrown when the Revit user cancels this operation.
Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException: Thrown if this method is called during dynamic update.
Returns:
A reference object selected by user.
Note: if the user cancels the operation (for example, through ESC), the method will throw an OperationCanceledException instance.

Autodesk.Revit.UI.Selection.Selection
Contains the current user selection of elements within the project.
Remarks:
The Selection object is used to retrieve the current user selected elements when an external API command is executed.